app/Http/Controllers/DashboardController.php

select * from `inventarios` where `cantidad` < 5
select * from `inventarios` where `inventarios`.`id` in (9, 11, 18, 19, 22)
select `producto_id`, SUM(cantidad) as total_vendida from `factura_cliente_items` group by `producto_id` order by `total_vendida` desc limit 5
select count(*) as aggregate from `inventarios`
select sum(`cantidad`) as aggregate from `inventarios`
select * from `users` where `users`.`id` in (1, 2, 13, 14)
select count(*) as aggregate from `users`
---
    public function index()
    {
        // Ventas agrupadas por mes
        $ventasPorMes = FacturaCliente::select(
            DB::raw('MONTH(created_at) as mes'),
            DB::raw('SUM(total) as total')
        )
        ->groupBy(DB::raw('MONTH(created_at)'))
        ->orderBy(DB::raw('MONTH(created_at)'))
        ->get();

        // Productos con bajo inventario
        $productosBajos = Inventario::where('cantidad', '<', 5)->get();

        // Productos más vendidos
        $productosMasVendidos = FacturaClienteItem::select('producto_id', DB::raw('SUM(cantidad) as total_vendida'))
            ->groupBy('producto_id')
            ->orderByDesc('total_vendida')
            ->take(5)
            ->with('inventario')
            ->get();

        $totalVentasHoy = FacturaCliente::whereDate('created_at', today())->sum('total');
        $totalVentasSemana = FacturaCliente::whereBetween('created_at', [
            Carbon::now()->startOfWeek(), // lunes a las 00:00
            Carbon::now()->endOfWeek(),   // domingo a las 23:59
        ])->sum('total');
        $totalFacturas = FacturaCliente::count();
        $totalInventario = Inventario::sum('cantidad');
        $totalProductos = Inventario::count();
        $totalUsuarios = User::count();

select count(*) as aggregate from `users` where date(`last_login_at`) = '2025-06-24'
select * from `posts` order by `created_at` desc limit 5
select * from `users` where `users`.`id` in (1, 14)
---
        $ultimasFacturasProveedores = FacturaProveedor::with('proveedor')->latest()->take(5)->get();
        $totalUsuarios = User::count();

        $usuariosHoy = DB::table('users')
            ->whereDate('last_login_at', Carbon::today())
            ->count();

        $posts = Post::with('user')->latest()->take(5)->get(); // últimos 5