app/Http/Controllers/Admin/CategoriaController.php

    public function index()
    {
        $categorias = Categoria::with('tipoArticulos')->get();
---
select * from `categorias`
select * from `tipo_articulos` where `tipo_articulos`.`categoria_id` in (1, 2, 3, 4, 5, 6, 8)