app/Http/Controllers/Admin/EmpresaController.php

    public function index()
    {
        $empresas = Empresa::all();
---
select * from `empresas`