app/Http/Controllers/Admin/FacturaClienteController.php

    public function index()
    {
        $facturas = FacturaCliente::with('empresa')->get();
---
select * from `empresas` where `empresas`.`id` in (1)

    public function create()
    {
        $empresas = Empresa::all();
        $clientes = User::all();

        $productos = Producto::with('inventario')
            ->whereHas('inventario', function ($query) {
                $query->where('cantidad', '>', 0);
            })->get();
---
select * from `empresas`
select * from `users`
select * from `inventarios` where `inventarios`.`producto_id` in (8, 9, 10, 11, 13, 15, 16, 18, 19)
select * from `productos` where exists (select * from `inventarios` where `productos`.`id` = `inventarios`.`producto_id` and `cantidad` > 0)