app/Http/Controllers/Admin/FacturaProveedorController.php

    public function create()
    {
        $proveedores = Proveedor::all();
        $empresas = Empresa::all();
        $productos = Producto::with('unidadMedida')->get();
---
select * from `empresas`
select * from `productos`
select * from `unidad_medidas` where `unidad_medidas`.`id` in (1, 2, 4, 5, 6)