app/Http/Controllers/Admin/PostController.php

select * from `posts`
select * from `users` where `users`.`id` in (1, 14)
---
    public function index()
    {
        $posts = Post::with('user')->get();

select * from `users`
---
    public function create()
    {
        $users = User::all();