app/Http/Controllers/Admin/ProductoController.php

    public function index()
    {
        $productos = Producto::with(['proveedor', 'categoria', 'tipoArticulo', 'unidadMedida'])->get();
        $proveedores = Proveedor::all();
        $categorias = Categoria::all();
        $tipoArticulos = TipoArticulo::all();
        $unidadMedidas = UnidadMedida::all();
---
select * from `categorias` where `categorias`.`id` in (1, 2, 3, 4, 5, 6)
select * from `productos`
select * from `tipo_articulos` where `tipo_articulos`.`id` in (1, 2, 4, 5, 6, 7, 8, 9, 10, 11, 12, 14, 15, 18)
select * from `unidad_medidas` where `unidad_medidas`.`id` in (1, 2, 4, 5, 6)
select * from `categorias`
select * from `tipo_articulos`
select * from `unidad_medidas`

    public function create()
    {
        $proveedores = Proveedor::all();
        $categorias = Categoria::all();
        $tipoArticulos = TipoArticulo::all();
        $unidadMedidas = UnidadMedida::all();
---
select * from `categorias`
select * from `tipo_articulos`
select * from `unidad_medidas`

    public function store(Request $request)
    {
        $data = $request->validate([
            'nombre' => 'required|string|max:255',
            'precio' => 'required|numeric',
            'descuento' => 'nullable|numeric',
            'categoria_id' => 'required|exists:categorias,id',
            'tipo_articulos_id' => 'required|exists:tipo_articulos,id',
            'proveedor_id' => 'required|exists:proveedores,id',
            'unidad_medida_id' => 'required|exists:unidad_medidas,id',
            'foto' => 'nullable|image|mimes:jpeg,png,jpg,gif|max:2048',
            'foto_url' => 'nullable|url',
            'descripcion' => 'nullable|string',
        ]);

        if ($request->hasFile('foto')) {
            $data['foto'] = $request->file('foto')->store('productos', 'public');
        } elseif ($request->filled('foto_url')) {
            $data['foto'] = $request->foto_url;
        }

        Producto::create($data);
---
insert into `productos` (`nombre`, `precio`, `descuento`, `categoria_id`, `tipo_articulos_id`, `proveedor_id`, `unidad_medida_id`, `descripcion`, `foto`, `updated_at`, `created_at`) values ('Tenis Invictus 77', '368500', '0', '1', '1', '1', '1', 'Tenis nuevos sin garantia', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSniSqWVT8VQZdLMBrEcYmBmpsnUW8KRbCCQA&s', '2025-06-24 02:05:49', '2025-06-24 02:05:49')

    public function edit(Producto $producto)
    {
        $proveedores = Proveedor::all();
        $categorias = Categoria::all();
        $tipoArticulos = TipoArticulo::all();
        $unidadMedidas = UnidadMedida::all();
---
select * from `categorias`
select * from `tipo_articulos`
select * from `unidad_medidas`