app/Http/Controllers/Admin/TipoArticuloController.php

    public function index()
    {
        $tipoArticulos = TipoArticulo::with('categoria')->get();
---
select * from `categorias` where `categorias`.`id` in (1, 2, 3, 4, 5, 6, 8)
select * from `tipo_articulos`

    public function create()
    {
        $categorias = Categoria::all();
---
select * from `categorias`

    public function store(Request $request)
    {
        $request->validate([
            'nombre' => 'required|string|max:255',
            'categoria_id' => 'required|exists:categorias,id',
        ]);

        TipoArticulo::create($request->only('nombre', 'categoria_id'));
---
insert into `tipo_articulos` (`nombre`, `categoria_id`, `updated_at`, `created_at`) values ('Televisores', '4', '2025-06-24 02:22:55', '2025-06-24 02:22:55')