app/Http/Controllers/Admin/UnidadMedidaController.php

select * from `unidad_medidas`
---
    public function index()
    {
        $unidadMedidas = UnidadMEdida::all();