app/Http/Controllers/Admin/UserController.php

    public function index()
    {

        $users = User::with('roles')->get(); // ← eager loading de roles
---
select * from `users`

    public function edit(User $user)
    {
        $roles = Role::all();
---
select * from `roles`